"CIAdditionCompositing" = "Ajoute des composantes de couleur pour augmenter la luminosité. Ce filtre est habituellement utilisé pour appliquer des effets de mise en valeur et de lumière parasite.";"CIAffineClamp" = "Applique une transformation affine à une image source puis bride vers l’extérieur les pixels aux bords de l’image transformée. Ce filtre est similaire au filtre CIAffineTransform sauf qu’il produit une image étendue à l’infini. Utilisez ce filtre lorsque vous souhaitez rendre une image floue en évitant une légère bordure noire.";"CIAffineTile" = "Applique une transformation affine à une image puis dispose l’image en mosaïque.";"CIAffineTransform" = "Applique une transformation affine à une image. Vous pouvez déplacer, faire pivoter, ou modifier l’échelle de l’image d’origine. Vous pouvez aussi appliquer n’importe quelle combinaison de ces opérations.";"CIBarsSwipeTransition" = "Effectue une transition d’une image à une autre en effaçant des portions rectangulaires de l’image au premier plan pour révéler l’image cible.";"CIBlendWithMask" = "Utilise les valeurs d’un masque d’échelle de gris pour interpoler entre une image et l’arrière-plan. Avec une valeur de masque de 0,0, le résultat est l’arrière plan. Avec une valeur de 1,0, le résultat est l’image.";"CIBloom" = "Adoucit les angles et applique un bel éclat à l’image.";"CIBoxBlur" = "Lisse ou augmente la netteté d’une image en utilisant un noyau de convolution en forme de boîte.";"CIBumpDistortion" = "Crée une bosse concave ou convexe qui part du point indiqué dans l’image.";"CIBumpDistortionLinear" = "Crée une bosse qui part d’une portion linéaire de l’image.";"CICMYKHalftone" = "Crée une couleur, rendu tramé de l’image source, en utilisant des encres cyan, magenta, jaune et noire sur une page blanche.";"CICheckerboardGenerator" = "Génère un motif d’échiquier. Vous pouvez préciser la taille et les couleurs de l’échiquier, ainsi que la netteté du motif.";"CICircleSplashDistortion" = "Déforme les pixels depuis la circonférence du cercle et vers l’extérieur.";"CICircularScreen" = "Simule un écran circulaire en demi-teinte.";"CICircularWrap" = "Enveloppe une image autour d’un cercle transparent. La distorsion de l’image augmente avec la distance depuis le centre du cercle.";"CIColorControls" = "Ajuste les valeurs de saturation, de luminosité, et de contraste.";"CIColorCube" = "Utilise une table de couleurs à trois dimensions pour transformer les pixels de l’image source. La table de couleurs doit être composée de cellules RGBA à virgule flottante utilisant alpha prémultiplié. Les cellules sont classées dans un ordre standard. Les lignes et colonnes de données sont indexées selon le vert et le rouge, respectivement. Chaque plan de données est suivi du plan immédiatement supérieur parmi les données, les plans étant indexés selon le bleu.";"CIColorInvert" = "Inverse les couleurs d’une image.";"CIColorMap" = "Applique une transformation non linéaire des couleurs source selon une table contenant les valeurs de correspondance.";"CIColorMatrix" = "Multiplie les valeurs de couleur source et ajoute un facteur biais à chaque composante de couleur.";"CIColorMonochrome" = "Modifie les couleurs de façon à ce qu’elles représentent des nuances d’une même couleur.";"CIColorPosterize" = "Applique les composantes rouge, verte et bleue selon le nombre de valeurs de luminosité indiqué pour chaque composante de couleur. Ce filtre aplatit les couleurs pour donner une apparence proche de celle d’un poster en sérigraphie.";"CIComicEffect" = "Simule un dessin de bande dessinée en détourant les bords et en appliquant un effet de couleur demi-teinte.";"CIConstantColorGenerator" = "Génère une couleur unie. Le résultat de ce filtre est typiquement utilisé comme source pour un autre filtre.";"CICopyMachineTransition" = "Effectue la transition d’une image à une autre en simulant un effet « photocopieur ».";"CICrop" = "Rogne une image. La taille et la forme de l’image rognée dépendent du rectangle spécifié.";"CICrystallize" = "Crée des blocs polygonaux de couleur en agglomérant les valeurs pixel-couleur source.";"CIDiscBlur" = "Lisse ou augmente la netteté d’une image en utilisant un noyau de convolution en forme de disque.";"CIDisintegrateWithMaskTransition" = "Effectue la transition d’une image à une autre en employant la forme définie par un masque.";"CIDisplacementDistortion" = "Applique à la première image les valeurs de niveaux de gris de la deuxième. La texture de l’image résultante est définie par les valeurs de niveaux de gris.";"CIDissolveTransition" = "Utilise un fondu pour effectuer la transition d’une image à une autre.";"CIDotScreen" = "Simule les motifs à points d’un écran demi-teinte.";"CIEdges" = "Trouve tous les bords dans une image et les affiche en couleur.";"CIEdgeWork" = "Produit un rendu noir et blanc stylisé d’une image dont l’apparence est similaire à celle d’une estampe.";"CIEightfoldReflectedTile" = "Produit une mosaïque à partir d’une image source en appliquant une symétrie réfléchie 8 fois.";"CIExposureAdjust" = "Ajuste le réglage d’exposition d’une image, de la même façon que vous contrôlez l’exposition sur un appareil photo en changeant la valeur du nombre F.";"CIFalseColor" = "Applique une luminance selon une rampe de deux couleurs. Une fausse couleur est souvent employée pour traiter des données astronomiques ou scientifiques, telles que les images d’ultra-violets ou radiographiques.";"CIFastBoxBlur" = "Lisse ou augmente la netteté d’une image en utilisant un noyau de convolution en forme de boîte.";"CIFastDiscBlur" = "Lisse ou augmente la netteté d’une image en utilisant un noyau de convolution en forme de disque.";"CIFlashTransition" = "Effectue la transition d’une image à une autre en créant un flash à partir du point que vous spécifiez. D’abord petit, il grandit rapidement jusqu’à ce que la couleur du flash occupe tout le cadre de l’image. La couleur disparaît progressivement pour laisser place à l’image cible.";"CIFourfoldReflectedTile" = "Produit une mosaïque à partir d’une image source en appliquant une symétrie réfléchie 4 fois.";"CIFourfoldRotatedTile" = "Produit une mosaïque à partir d’une image source en faisant pivoter la source par étapes de 90 degrés.";"CIFourfoldTranslatedTile" = "Produit une mosaïque à partir d’une image source en appliquant un effet de déplacement 4 fois.";"CIGammaAdjust" = "Ajuste la luminosité des tons moyens. Ce filtre est typiquement utilisé pour compenser l’effet non linéaire des écrans. L’ajustement du gamma change effectivement la courbe de transition entre noir et blanc.";"CIGaussianBlur" = "Répartit les pixels source d’une valeur spécifiée par une distribution gaussienne.";"CIGaussianGradient" = "Génère un dégradé qui passe d’une couleur à une autre selon une distribution gaussienne.";"CIGlassDistortion" = "Déforme une image en appliquant une texture type verre. La portion relevée de l’image est le résultat de l’application de la texture.";"CIGlassLozenge" = "Crée une lentille en forme de losange et déforme la portion de l’image sous laquelle la lentille est placée.";"CIGlideReflectedTile" = "Produit une mosaïque à partir d’une image source en déplaçant et en étalant l’image.";"CIGloom" = "Ternit les zones en valeur d’une image.";"CIHatchedScreen" = "Simule le motif hachuré d’un écran demi-teinte.";"CIHeightFieldFromMask" = "Produit un champ de hauteur en trois dimensions, en forme de loft à partir d’un masque de niveaux de gris. Les valeurs blanches du masque définissent les pixels à l’intérieur du champ et les valeurs noires définissent ceux à l’extérieur. Le champ varie progressivement à l’intérieur du masque, atteignant la valeur 0 à la bordure du masque. Vous pouvez utiliser ce filtre en combinaison avec le filtre CIShadedMaterial pour produire des objets éclairés tout à fait réalistes.";"CIHexagonalPixellate" = "Affiche une image sous la forme d’hexagones dont la couleur est une moyenne des pixels qu’ils remplacent.";"CIHoleDistortion" = "Crée une surface circulaire qui pousse les pixels de l’image vers l’extérieur, en déformant le plus ceux se trouvant proches du cercle.";"CIHueAdjust" = "Modifie la teinte ou la nuance générale, des pixels source.";"CIKaleidoscope" = "Produit une image kaléidoscopique à partir d’une image source en appliquant une symétrie réfléchie 12 fois.";"CILanczosScaleTransform" = "Produit une version réduite ou agrandie de haute qualité de l’image source. Ce filtre est typiquement utilisé pour réduire l’échelle d’une image.";"CILenticularHaloGenerator" = "Simule un halo généré par la diffraction associée à la diffusion de la lentille. Ce filtre est typiquement appliqué à une autre image pour simuler un reflet d’objectif ou un effet similaire.";"CILineOverlay" = "Crée un esquisse qui met en valeur (noir) les contours d’une image, laissant transparentes les portions non détourées. Le résultat a une couche alpha et est rendu en noir, et ne donnera pas grand résultat avant d’être rendu au-dessus d’une autre image en mode source sur composition.";"CILineScreen" = "Simule le motif de traits d’un écran demi-teinte.";"CILinearGradient" = "Génère un dégradé qui varie selon un axe linéaire entre 2 extrémités définies.";"CIMaskToAlpha" = "Convertit une image en niveaux de gris en une image blanche masquée par alpha. Les valeurs blanches de l’image source produisent l’intérieur du masque ; les valeurs noires deviennent complètement transparentes.";"CIMaximumCompositing" = "Calcule la valeur maximum, par composante de couleur, de deux images et crée une image cible utilisant ces valeurs maximum. Effet connu sous le nom « dodging ».";"CIMedianFilter" = "Calcule la valeur médiane au sien d’un groupe de pixels voisins et remplace la valeur de chaque pixel par cette valeur médiane. L’effet obtenu est la réduction de bruit.";"CIMinimumCompositing" = "Calcule la valeur minimum, par composante de couleur, de deux images et crée une image cible utilisant ces valeurs minimum. Effet connu sous le nom « burning ».";"CIModTransition" = "Effectue la transition d’une image à une autre en révélant l’image cible au travers de trous de forme irrégulière.";"CIMotionBlur" = "Rend floue une image pour simuler l’effet obtenu par le déplacement de l’appareil photo d’une certaine distance et à un certain angle pendant la prise.";"CIMultiplyCompositing" = "Multiplie les composantes de couleur de deux images sources et crée une image cible utilisant les valeurs multipliées. Ce filtre est typiquement utilisé pour ajouter un effet de projecteur ou d’éclairage similaire à une image.";"CINoiseReduction" = "Réduit le bruit selon une valeur seuil qui détermine ce qui peut être considéré comme bruit. De faibles changements de luminance sous ce seuil sont considérés comme du bruit et reçoivent un traitement de réduction de bruit (un flou localisé). Les changements au-delà la valeur seuil sont traités comme des bords et leur netteté est augmentée.";"CIOpTile" = "Segmente une image en appliquant toute rotation ou changement d’échelle spécifié, puis rassemble l’image pour lui donner une apparence d’art cinétique (illusion d’optique).";"CIPageCurlTransition" = "Effectue la transition d’une image à une autre en simulant une page qui se tourne, révélant la nouvelle image au fur et à mesure que la précédente se tourne.";"CIParallelogramTile" = "Déforme une image en la réfléchissant sur un parallélogramme, puis présente le résultat en mosaïque.";"CIPerspectiveTile" = "Applique une transformation en perspective à une image, puis présente le résultat en mosaïque.";"CIPerspectiveTransform" = "Modifie la géométrie d’une image pour simuler le changement de point de vue de l’observateur. Vous pouvez utiliser le filtre perspective pour incliner l’image.";"CIPinchDistortion" = "Crée une surface rectangulaire qui tire les pixels de l’image vers l’intérieur, en déformant le plus ceux se trouvant proches du rectangle.";"CIPixellate" = "pixelise une image.";"CIPointillize" = "Traite l’image source pour lui donner un style pointilliste.";"CIRadialGradient" = "Génère un dégradé qui varie de façon radiale entre deux cercles de même centre. L’un des deux cercles peut avoir un rayon nul.";"CIRandomGenerator" = "Génère une image reproduite à l’infini, dont les valeurs de pixels sont déterminées à partir de quatre nombres uniformément aléatoires, indépendants et compris entre 0 et 1.";"CIRippleTransition" = "Effectue la transition d’une image à une autre en créant une vague circulaire partant du centre, révélant la nouvelle image au passage de la vague.";"CISepiaTone" = "Transpose les couleurs d’une image en nuances de marron.";"CIShadedMaterial" = "Produit une image éclairée à partir d’un champ de hauteur. Le champ de hauteur est tel que la hauteur est plus grande avec des nuances plus claires, et plus petite (moins de zones) avec des nuances plus sombres. Vous pouvez utiliser ce filtre en combinaison avec le filtre CIHeightFieldFromMask pour obtenir de rapides nuances de masques, tels que du texte. ";"CISharpenLuminance" = "Augmente la netteté de l’image. Ce filtre opère sur la luminance de l’image ; la chrominance des pixels reste intacte.";"CISixfoldReflectedTile" = "Produit une mosaïque à partir d’une image source en appliquant une symétrie réfléchie 6 fois.";"CISixfoldRotatedTile" = "Produit une mosaïque à partir d’une image source en faisant pivoter la source par étapes de 60 degrés.";"CISourceAtopCompositing" = "Place l’image source sur l’image de fond, puis utilise la luminance de l’image de fond pour déterminer le résultat visible. La composition montre l’image de fond et uniquement les portions de l’image source au-dessus des parties visibles de l’arrière-plan.";"CISourceInCompositing" = "Utilise une deuxième image pour définir la portion de l’image source à conserver, appliquant ainsi un rognage.";"CISourceOutCompositing" = "Utilise une deuxième image pour définir la portion de la première image à retirer.";"CISourceOverCompositing" = "Place une deuxième image par-dessus la première.";"CISpotColor" = "Remplace une ou plusieurs couleurs par les couleurs de tache.";"CISpotLight" = "Applique un effet de projecteur directionnel à une image.";"CIStarShineGenerator" = "Génère un motif de type explosion d’étoiles. L’image résultante est typiquement employée comme source pour un autre filtre";"CIStripesGenerator" = "Génère un motif hachuré. Vous pouvez préciser la couleur, l’espacement et le contraste des rayures.";"CISunbeamsGenerator" = "Génère un effet de soleil. Le résultat du filtre « rayons de soleils » est typiquement utilisé comme source d’un filtre composite.";"CISwipeTransition" = "Effectue la transition d’une image à une autre en simulant un effet de balayage.";"CITorusLensDistortion" = "Crée une lentille en forme de tore et déforme la portion de l’image sous laquelle la lentille est placée.";"CITriangleTile" = "Délimite une portion triangulaire de l’image, puis présente le résultat en mosaïque.";"CITwelvefoldReflectedTile" = "Produit une mosaïque à partir d’une image source en appliquant une symétrie réfléchie 12 fois.";"CITwirlDistortion" = "Fait pivoter les pixels autour d’un point, donnant une impression de spirale. Vous pouvez préciser le nombre de rotations ainsi que le centre et le rayon de l’effet.";"CIUnsharpMask" = "Augmente le contraste des contours entre pixels de différentes couleurs dans une image.";"CIVortexDistortion" = "Fait pivoter les pixels autour d’un point pour simuler un tourbillon. Vous pouvez préciser le nombre de rotations ainsi que le centre et le rayon de l’effet.";"CIWhitePointAdjust" = "Ajuste le point de référence des blancs pour une image and transpose toutes les couleurs de la source selon la nouvelle référence.";"CIZoomBlur" = "Simule un effet de zoom de l’appareil pendant la prise de vue.";"CIColorBlendMode" = "Utilise les valeurs de luminance de l’arrière-plan avec les valeurs de teinte et de saturation de l’image source. Ce mode préserve les niveaux de gris de l’image.";"CIColorBurnBlendMode" = "Assombrit les échantillons de l’image en arrière-plan pour refléter les échantillons de l’image source. Les valeurs « blanches » des échantillons de l’image source ne provoquent aucun changement.";"CIColorDodgeBlendMode" = "Éclaircit les échantillons de l’image en arrière-plan pour refléter les échantillons de l’image source. Les valeurs « noires » des échantillons de l’image source ne provoquent aucun changement..";"CIDarkenBlendMode" = "Crée des échantillons d’image composite en choisissant les échantillons les plus sombres parmi l’image source ou l’arrière-plan. Résultat, les échantillons de l’image en arrière-plan sont remplacés par des échantillons plus sombres provenant de l’image source. Les autres échantillons de l’image en arrière-plan restent intacts.";"CIDifferenceBlendMode" = "Soustrait de l’image en arrière-plan la couleur de l’échantillon de l’image source, ou l’inverse, en fonction de celui dont la luminosité est la plus forte. Les valeurs noires d’échantillon de l’image source ne produisent aucun changement alors que la valeur blanche inverse les valeurs de couleurs de fond.";"CIExclusionBlendMode" = "Produit un effet similaire à celui produit par le filtre CIDifferenceBlendMode mais avec moins de contraste. Les valeurs noires des échantillons de l’image source ne provoquent aucun changement alors que les valeurs blanches inversent les valeurs de couleur de l’arrière-plan.";"CIHardLightBlendMode" = "Multiplie ou filtre les couleurs, selon la couleur de l’échantillon de l’image source. Si la couleur de l’échantillon de l’image source est plus claire qu’un gris 50%, l’arrière-plan est éclairci, c’est le filtrage. Si la couleur de l’échantillon de l’image source est plus sombre qu’un gris 50%, l’arrière-plan est assombri, c’est la multiplication. Si la couleur de l’échantillon de l’image source est égale à un gris 50%, l’image source est inchangée. Les échantillons d’image purement noirs ou purement blancs donnent une image purement noire ou purement blanche. L’effet général est similaire à celui obtenu en braquant un puissant projecteur sur l’image source.";"CIHueBlendMode" = "Utilise les valeurs de luminance et de saturation de l’arrière-plan avec la teinte de l’image source.";"CILightenBlendMode" = "Crée des échantillons d’images composites en choisissant les échantillons les plus clairs parmi l’image source ou l’arrière-plan. Les échantillons de l’image de fond sont remplacés par les échantillons correspondant de l’image source si ces derniers sont plus clairs. Sinon, les échantillons de l’image de fond sont laissés intacts.";"CILuminosityBlendMode" = "Utilise les valeurs de teinte et de saturation de l’arrière-plan avec la luminance de l’image source. Ce mode crée l’effet opposé de celui obtenu avec le filtre CIColorBlendMode.";"CIMultiplyBlendMode" = "Multiplie les échantillons de l’image source avec ceux de l’image de fond. Ceci produit des couleurs au moins aussi sombres que celles de l’un ou l’autre des échantillons fournis.";"CIOverlayBlendMode" = "Multiplie ou filtre les échantillons de l’image source avec les échantillons de l’image de fond, en fonction de la couleur de l’arrière-plan. Le résultat obtenu est de recouvrir les échantillons de l’image existante tout en préservant les éléments dominant et les ombres de l’arrière-plan. La couleur de fond se mélange avec l’image source pour refléter la clarté ou l’obscurité de l’arrière-plan.";"CISaturationBlendMode" = "Utilise les valeurs de luminance et de teinte de l’arrière-plan avec la saturation de l’image source. Les zones de l’arrière-plan sans saturation (c’est-à-dire purement les zones de gris) ne sont pas modifiées.";"CIScreenBlendMode" = "Multiplie l’inverse des échantillons de l’image source avec l’inverse des échantillons de l’arrière-plan. Ceci produit des couleurs au moins aussi claires que celles de l’un ou l’autre des échantillons fournis.";"CISoftLightBlendMode" = "Assombrit ou éclaircit les couleurs, selon la couleur de l’échantillon de l’image source. Si la couleur de l’échantillon de l’image source est plus claire qu’un gris 50%, l’arrière-plan est éclairci, c’est le « dodging ». Si la couleur de l’échantillon de l’image source est plus sombre qu’un gris 50%, l’arrière-plan est assombri, c’est le « burning ». Si la couleur de l’échantillon de l’image source est égale à un gris 50%, l’arrière-plan est inchangé. Les échantillons d’image purement noirs ou purement blancs produisent des zones plus sombres ou plus claires, mais ne donneront pas une image purement noire ou purement blanche. L’effet général est similaire à celui obtenu en braquant un projecteur diffus sur l’image source.";"outputImage" = "L’image produite par un filtre.";"inputBackgroundImage" = "L’image à utiliser comme image de fond.";"inputImage" = "L’image à utiliser comme image de départ. Pour les filtres qui utilisent également une image de fond, ceci est l’image au premier plan.";"inputTime" = "La durée de l’effet.";"inputTransform" = "Une transformation à appliquer.";"inputScale" = "La valeur de l’effet.";"inputAspectRatio" = "Proportions";"inputCenter" = "Le centre de la zone à filtrer (coordonnées x et y).";"inputRadius" = "La distance depuis le centre de l’effet.";"inputAngle" = "Un angle.";"inputRefraction" = "L’indice de réfraction de la matière (telle que le verre) utilisé par cet effet.";"inputWidth" = "La largeur de l’effet.";"inputSharpness" = "Le niveau de netteté à appliquer.";"inputIntensity" = "L’intensité de l’effet.";"inputEV" = "Le nombre de F-stops plus clairs ou plus sombres qui constituent l’image.";"inputSaturation" = "La valeur de l’ajustement de la saturation.";"inputColor" = "Une couleur.";"inputBrightness" = "Niveau de luminosité.";"inputContrast" = "Niveau de contraste.";"inputGradientImage" = "Une carte de l’environnement avec alpha. Habituellement une image contenant accent et ombre.";"inputMaskImage" = "Une image masque.";"inputShadingImage" = "Une carte de l’environnement avec valeurs alpha. Habituellement une image contenant accent et ombre.";"inputTargetImage" = "L’image cible de la transition.";"inputExtent" = "Un rectangle qui définit l’étendue de l’effet.";"CIBoxBlur.inputRadius" = "Le rayon détermine le nombre de pixels utilisés pour créer le flou. Plus le rayon est grand, plus l’image est floue.";"CIDiscBlur.inputRadius" = "Le rayon détermine le nombre de pixels utilisés pour créer le flou. Plus le rayon est grand, plus l’image est floue.";"CIGaussianBlur.inputRadius" = "Le rayon détermine le nombre de pixels utilisés pour créer le flou. Plus le rayon est grand, plus l’image est floue.";"CIMotionBlur.inputRadius" ="Le rayon détermine le nombre de pixels utilisés pour créer le flou. Plus le rayon est grand, plus l’image est floue.";"CIMotionBlur.inputAngle" = "L’angle de l’animation détermine dans quelle direction le flou s’étale.";"CINoiseReduction.inputNoiseLevel" = "La quantité de réduction de bruit. Plus la valeur est élevée, plus le bruit est réduit.";"CINoiseReduction.inputSharpness" = "La netteté de l’image finale. Plus la valeur est élevée, plus le résultat est net.";"CIZoomBlur.inputCenter" = "La position x et y à employer comme centre de l’effet.";"CIZoomBlur.inputAmount" = "La quantité de zoom avant. Plus la valeur est élevée, plus le zoom est important.";"CIColorControls.inputSaturation" = "La quantité de saturation à appliquer. Plus la valeur est élevée, plus le résultat est saturé.";"CIColorControls.inputBrightness" = "La quantité de luminosité à appliquer. Plus la valeur est élevée, plus le résultat est lumineux.";"CIColorControls.inputContrast" = "La quantité de contraste à appliquer. Plus la valeur est élevée, plus l’image est contrastée.";"CIColorMatrix.inputRVector" = "La quantité de rouge à utiliser pour multiplier les valeurs de couleurs de la source.";"CIColorMatrix.inputGVector" = "La quantité de vert à utiliser pour multiplier les valeurs de couleurs de la source.";"CIColorMatrix.inputBVector" = "La quantité de bleu à utiliser pour multiplier les valeurs de couleurs de la source.";"CIColorMatrix.inputAVector" = "La quantité d’alpha à utiliser pour multiplier les valeurs de couleurs de la source.";"CIColorMatrix.inputBiasVector" = "Un vecteur qui est ajouté à chaque composante de couleur.";"CIExposureAdjust.inputEV" = "La valeur de l’ajustement de l’exposition. Plus la valeur est élevée, plus l’exposition est lumineuse.";"CIGammaAdjust.inputPower" = "La valeur gamma à employer pour corriger la luminosité de l’image. Plus la valeur est élevée, plus le résultat est sombre.";"CIHueAdjust.inputAngle" = "L’angle à utiliser pour corriger la teinte de l’image (en degrés).";"CIWhitePointAdjust.inputColor" = "La couleur à utiliser comme point blanc.";"CIColorCube.inputDimension" = "La dimension de la table de couleurs.";"CIColorCube.inputCubeData" = "Table de couleurs de cellules RGBA à virgule flottante utilisant alpha prémultiplié. Les cellules sont classées dans un ordre standard. Les lignes et colonnes de données sont indexées selon le vert et le rouge, respectivement. Chaque plan de données est suivi du plan immédiatement supérieur parmi les données, les plans étant indexés selon le bleu.";"CIColorMap.inputGradientImage" = "Les données graphiques de cette image transforment les valeurs de l’image source.";"CIColorMonochrome.inputColor" = "La couleur monochrome à appliquer à l’image.";"CIColorMonochrome.inputIntensity" = "L’intensité de l’effet monochrome. Une valeur de 1.0 crée une image monochrome avec la couleur indiquée. Une valeur nulle n’a aucun effet sur l’image.";"CIColorPosterize.inputLevels" = "Le nombre de niveaux de luminosité à employer pour chaque composante de couleur. De faibles valeurs donneront un effet de poster plus extrême.";"CIFalseColor.inputColor0" = "La première couleur à employer pour la rampe de couleurs.";"CIFalseColor.inputColor1" = "La deuxième couleur à employer pour la rampe de couleurs.";"CISepiaTone.inputIntensity" = "L’intensité de l’effet sépia. Une valeur de 1,0 crée une image sépia monochrome. Une valeur nulle n’a aucun effet sur l’image.";"CIBumpDistortion.inputCenter" = "La position x et y à employer comme centre de la bosse."; "CIBumpDistortion.inputRadius" = "Le rayon détermine le nombre de pixels utilisés pour créer la distorsion. Plus le rayon est grand, plus la distorsion est importante."; "CIBumpDistortion.inputScale" = "L’échelle de l’effet détermine la courbure de la bosse. Une valeur nulle signifie aucun effet. Une valeur positive crée une bosse convexe et une valeur négative, une bosse concave."; "CIBumpDistortionLinear.inputCenter" = "La position x et y à employer comme centre de la distorsion."; "CIBumpDistortionLinear.inputRadius" = "Le rayon détermine le nombre de pixels utilisés pour créer la distorsion. Plus le rayon est grand, plus la distorsion est importante.";  "CIBumpDistortionLinear.inputScale" = "L’échelle de l’effet."; "CIBumpDistortionLinear.inputAngle" = "L’angle (en degrés) de la ligne autour de laquelle la distorsion est appliquée."; "CICircleSplashDistortion.inputCenter" = "La position x et y à employer comme centre de la distorsion.";  "CICircleSplashDistortion.inputRadius" = "Le rayon détermine le nombre de pixels utilisés pour créer la distorsion. Plus le rayon est grand, plus la distorsion est importante.";  "CICircularWrap.inputCenter" = "La position x et y à employer comme centre de la distorsion.";  "CICircularWrap.inputRadius" = "Le rayon détermine le nombre de pixels utilisés pour créer la distorsion. Plus le rayon est grand, plus la distorsion est importante.";  "CICircularWrap.inputAngle" = "L’angle de l’effet."; "CIDisplacementDistortion.inputDisplacementImage" = "Une image dont les valeurs de niveaux de gris seront appliquées à l’image source."; "CIDisplacementDistortion.inputScale" = "La quantité de texture de l’image cible. Plus la valeur est élevée, plus la texture importante."; "CIGlassDistortion.inputTexture" = "La texture à appliquer à l’image source.";"CIGlassDistortion.inputCenter" = "La position x et y à employer comme centre de la distorsion."; "CIGlassDistortion.inputScale" = "La quantité de texture de l’image cible. Plus la valeur est élevée, plus la texture importante."; "CIGlassLozenge.inputPoint0" = "La position x et y à employer comme centre du cercle à l’une des extrémités du losange."; "CIGlassLozenge.inputPoint1" = "La position x et y à employer comme centre du cercle à l’autre des extrémités du losange.";  "CIGlassLozenge.inputRadius" = "Le rayon du losange. Plus le rayon est grand, plus la distorsion est importante.";  "CIGlassLozenge.inputRefraction" = "La réfraction du verre."; "CIHoleDistortion.inputCenter" = "La position x et y à employer comme centre de la distorsion.";  "CIHoleDistortion.inputRadius" = "Le rayon détermine le nombre de pixels utilisés pour créer la distorsion. Plus le rayon est grand, plus la distorsion est importante.";  "CIPinchDistortion.inputCenter" = "La position x et y à employer comme centre de la distorsion."; "CIPinchDistortion.inputRadius" = "Le rayon détermine le nombre de pixels utilisés pour créer la distorsion. Plus le rayon est grand, plus la distorsion est importante."; "CIPinchDistortion.inputScale" = "La quantité de pincement. Une valeur nulle signifie aucun effet ; une valeur de 1,0 représente le pincement maximum.";"CITorusLensDistortion.inputCenter" = "La position x et y à employer comme centre du tore.";  "CITorusLensDistortion.inputRadius" = "Le rayon externe du tore.";  "CITorusLensDistortion.inputWidth" = "La largeur de l’anneau."; "CITorusLensDistortion.inputRefraction" = "La réfraction du verre."; "CITwirlDistortion.inputCenter" = "La position x et y à employer comme centre de la distorsion.";  "CITwirlDistortion.inputRadius" = "Le rayon détermine le nombre de pixels utilisés pour créer la distorsion. Plus le rayon est grand, plus la distorsion est importante."; "CITwirlDistortion.inputAngle" = "L’angle de la spirale (en degrés). Les valeurs peuvent être positives ou négatives.";"CIVortexDistortion.inputCenter" = "La position x et y à employer comme centre de la distorsion."; "CIVortexDistortion.inputRadius" = "Le rayon détermine le nombre de pixels utilisés pour créer la distorsion. Plus le rayon est grand, plus la distorsion est importante."; "CIVortexDistortion.inputAngle" = "L’angle du vortex (en degrés).";"CICheckerboardGenerator.inputColor0" = "Une couleur à employer pour la première catégorie de cases sur l’échiquier.";"CICheckerboardGenerator.inputColor1" = "Une couleur à employer pour la deuxième catégorie de cases sur l’échiquier.";"CICheckerboardGenerator.inputWidth" = "La largeur d’une case dans le motif de l’échiquier.";"CICheckerboardGenerator.inputSharpness" = "La netteté du motif de l’échiquier. Plus la valeur est faible, plus le motif est flou. Les valeurs s’échelonnent entre 0,0 et 1,0.";"CIConstantColorGenerator.inputColor" = "La couleur à générer."; "CILenticularHaloGenerator.inputCenter" = "La position x et y à employer comme centre du halo.";"CILenticularHaloGenerator.inputHaloRadius" = "Le rayon du halo.";"CILenticularHaloGenerator.inputHaloWidth" = "La largeur du halo, depuis son rayon intérieur vers son rayon extérieur.";"CILenticularHaloGenerator.inputOverlap" = "La quantité de superposition des composantes de diffraction du halo. Une valeur de 1,0 représente une superposition complète ; le halo est blanc. Une valeur de 0,0 signifie aucune superposition ; Les couleurs du halo ne se superposent pas.";"CILenticularHaloGenerator.inputStriationStrength" = "L’intensité des couleurs du halo. Plus la valeur est élevée, plus le halo est intense.";"CILenticularHaloGenerator.inputStriationContrast" = "Le contraste des couleurs du halo. Plus la valeur est élevée, plus le contraste est important.";"CIStarShineGenerator.inputCenter" = "La position x et y à employer comme centre de l’étoile."; "CIStarShineGenerator.inputColor" = "La couleur à employer la coquille externe de l’étoile circulaire."; "CIStarShineGenerator.inputRadius" = "Le rayon de l’étoile."; "CIStarShineGenerator.inputCrossScale" = "La taille du motif croisé."; "CIStarShineGenerator.inputCrossAngle" = "L’angle du motif croisé."; "CIStarShineGenerator.inputCrossOpacity" = "L’opacité du motif croisé."; "CIStarShineGenerator.inputCrossWidth" = "La largeur du motif croisé."; "CIStarShineGenerator.inputEpsilon" = "La longueur des pointes de la croix."; "CIStripesGenerator.inputCenter" = "La position x et y à employer comme centre du motif hachuré."; "CIStripesGenerator.inputColor0" = "La couleur à employer pour les hachures impaires."; "CIStripesGenerator.inputColor1" = "La couleur à employer pour les hachures paires.";"CIStripesGenerator.inputWidth" = "La largeur d’une hachure"; "CIStripesGenerator.inputSharpness" = "La netteté du motif hachuré. Plus la valeur est faible, plus le motif est flou. Les valeurs s’échelonnent entre 0,0 et 1,0."; "CISunbeamsGenerator.inputCenter" = "La position x et y à employer comme centre du motif « rayon de soleil »";"CISunbeamsGenerator.inputColor" = "La couleur du soleil.";"CISunbeamsGenerator.inputSunRadius" = "Le rayon du soleil.";"CISunbeamsGenerator.inputMaxStriationRadius" = "Le rayon des rayons de soleil.";"CISunbeamsGenerator.inputStriationStrength" = "L’intensité des rayons de soleil. Plus la valeur est élevée, plus le résultat est intense.";"CISunbeamsGenerator.inputStriationContrast" = "Le contraste des rayons de soleil. Plus la valeur est élevée, plus le contraste est important.";"CIAffineTransform.inputTransform" = "La transformation à appliquer à l’image."; "CICrop.inputRectangle" = "Le rectangle qui précise le rognage à appliquer à l’image."; "CILanczosScaleTransform.inputScale" = "Le facteur d’échelle à appliquer à l’image. Les valeurs inférieures à 1,0 réduisent l’échelle de l’image ; les valeurs supérieures à 1,0 augmentent l’échelle de l’image."; "CILanczosScaleTransform.inputAspectRatio" = "Les proportions de l’image."; "CIPerspectiveTransform.inputTopLeft" = "La coordonnée du coin supérieur gauche à laquelle faire correspondre l’image."; "CIPerspectiveTransform.inputTopRight" = "La coordonnée du coin supérieur droit à laquelle faire correspondre l’image."; "CIPerspectiveTransform.inputBottomRight" = "La coordonnée du coin inférieur droit à laquelle faire correspondre l’image."; "CIPerspectiveTransform.inputBottomLeft" = "La coordonnée du coin inférieur gauche à laquelle faire correspondre l’image."; "CIGaussianGradient.inputColor0" = "La première couleur à employer pour le dégradé."; "CIGaussianGradient.inputColor1" = "La deuxième couleur à employer pour le dégradé."; "CIGaussianGradient.inputRadius" = "Le rayon de la distribution gaussienne."; "CILinearGradient.inputPoint0" = "Le point de départ du dégradé ; là où la première couleur commence."; "CILinearGradient.inputPoint1" = "Le point d’arrivée du dégradé ; là où la deuxième couleur commence."; "CILinearGradient.inputColor0" = "La première couleur à employer pour le dégradé.";  "CILinearGradient.inputColor1" = "La deuxième couleur à employer pour le dégradé.";  "CIRadialGradient.inputRadius0" = "Le rayon du cercle de départ à utiliser dans le dégradé.";"CIRadialGradient.inputRadius1" = "Le rayon du cercle de fin à utiliser dans le dégradé.";"CIRadialGradient.inputColor0" = "La première couleur à employer pour le dégradé.";  "CIRadialGradient.inputColor1" = "La deuxième couleur à employer pour le dégradé."; "CICircularScreen.inputCenter" = "La position x et y à employer comme centre du motif d’écran circulaire"; "CICircularScreen.inputWidth" = "La distance entre les cercles du motif."; "CICircularScreen.inputSharpness" = "La netteté des cercles. Plus la valeur est élevée, plus les cercles sont nets."; "CICMYKHalftone.inputCenter" = "La position x et y à employer comme centre du motif demi-teinte";  "CICMYKHalftone.inputWidth" = "La distance entre les points du motif."; "CICMYKHalftone.inputAngle" = "L’angle du motif."; "CICMYKHalftone.inputSharpness" = "La netteté du motif. Plus la valeur est élevée, plus le motif est net."; "CICMYKHalftone.inputGCR" = "La valeur de remplacement pour la composante grise. Varie entre 0.0 (aucune) et 1.0."; "CICMYKHalftone.inputUCR" = "La valeur de suppression de couleur. Varie entre 0.0 et 1.0."; "CIDotScreen.inputCenter" = "La position x et y à employer comme centre du motif d’écran en pointillé";  "CIDotScreen.inputAngle" = "L’angle du motif."; "CIDotScreen.inputWidth" = "La distance entre les points du motif."; "CIDotScreen.inputSharpness" = "La netteté du motif. Plus la valeur est élevée, plus le motif est net."; "CIHatchedScreen.inputCenter" = "La position x et y à employer comme centre du motif d’écran à traits parallèles"; "CIHatchedScreen.inputAngle" = "L’angle du motif.";"CIHatchedScreen.inputWidth" = "La distance entre les lignes du motif."; "CIHatchedScreen.inputShaprness" = "La netteté du motif. Plus la valeur est élevée, plus le motif est net."; "CILineScreen.inputCenter" = "La position x et y à employer comme centre du motif d’écran à traits";  "CILineScreen.inputAngle" = "L’angle du motif."; "CILineScreen.inputWidth" = "La distance entre les lignes du motif."; "CILineScreen.inputSharpness" = "La netteté du motif. Plus la valeur est élevée, plus le motif est net."; 	"CISharpenLuminance.inputSharpness" = "Le niveau de netteté à appliquer. Les valeurs plus élevées augmentent la netteté.";"CIUnsharpMask.inputRadius" = "Le rayon autour d’un pixel donné dans lequel appliquer le masque de flou. Plus le rayon est grand, plus l’image est affectée.";"CIUnsharpMask.inputIntensity" = "L’intensité de l’effet. Plus la valeur est forte, plus le contraste de la zone concernée est élevé.";"CIBlendWithMask.inputMaskImage" = "Un masque d’échelle de gris. Avec une valeur de masque de 0,0, le résultat est l’arrière-plan. Avec une valeur de 1,0, le résultat est l’image."; "CIBloom.inputRadius" = "Le rayon détermine le nombre de pixels utilisés pour créer l’effet. Plus le rayon est grand, plus l’image est affectée.";"CIBloom.inputIntensity" = "L’intensité de l’effet. Une valeur de 0.0 signifie aucun effet. Une valeur de 1.0 représente l’effet maximum."; "CICrystallize.inputRadius" = "Le rayon détermine le nombre de pixels utilisés pour créer l’effet. Plus le rayon est grand, plus les cristaux résultant sont grands."; "CIEdges.inputIntensity" = "L’intensité de la bordure. Plus la valeur est forte, plus l’intensité est importante."; "CIEdgeWork.inputRadius" = "L’épaisseur de la bordure. Plus la valeur est élevée, plus les bords sont épais."; "CIGloom.inputRadius" = "Le rayon détermine le nombre de pixels utilisés pour créer l’effet. Plus le rayon est grand, plus l’image est affectée."; "CIGloom.inputIntensity" = "L’intensité de l’effet. Une valeur de 0.0 signifie aucun effet. Une valeur de 1.0 représente l’effet maximum."; "CIHeightFieldFromMask.inputImage" = "Les valeurs blanches du masque définissent les pixels à l’intérieur du champ et les valeurs noires définissent ceux à l’extérieur. Le champ varie progressivement à l’intérieur du masque, atteignant la valeur 0 à la bordure du masque."; "CIHeightFieldFromMask.inputRadius" = "La distance depuis la bordure du masque pour une transition fluide est proportionnelle à la valeur du rayon. Une valeur élevée produit une transition plus fluide et plus prononcée ; une faible valeur produit une transition s’approchant d’un filet de lumière."; "CIHexagonalPixellate.inputCenter" = "La position x et y à employer comme centre de l’effet."; "CIHexagonalPixellate.inputScale" = "L’échelle détermine la taille des hexagones. Une valeur élevée produit un hexagone plus grand."; "CILineOverlay.inputNRNoiseLevel" = "Le niveau de bruit de l’image déterminé à partir des données de l’appareil, qui est supprimé avant de tracer les contours de l’image. L’augmentation du niveau de bruit facilite la finition des contours tracés de l’image."; "CILineOverlay.inputNRSharpness" = "La quantité de netteté appliquée lors de la suppression de bruit de l’image, avant de tracer ses contours. Ceci améliore l’acquisition des contours."; "CILineOverlay.inputEdgeIntensity" = "Le facteur d’accentuation du dégradé Sobel lors du tracé de la bordure de l’image. Une valeur élevée trouve plus de contours, alors qu’une valeur faible (comme 1,0) est habituellement utilisée."; "CILineOverlay.inputThreshold" = "Cette valeur détermine la visibilité de la bordure. Une valeur élevée affine la bordure."; "CILineOverlay.inputContrast" = "La quantité d’anticrénelage à appliquer à la bordure produite par ce filtre. Plus la valeur est élevée, plus le contraste de la bordure est important (moins d’anticrénelage est appliqué)."; "CIPixellate.inputCenter" = "La position x et y à employer comme centre de l’effet.";  "CIPixellate.inputScale" = "L’échelle détermine la taille des carrés. Une valeur élevée produit un carré plus grand."; "CIPointillize.inputRadius" = "Le rayon des cercles dans le motif résultant."; "CIPointillize.inputCenter" = "La position x et y à employer comme centre de l’effet.";  "CIShadedMaterial.inputShadingImage" = "L’image à utiliser comme champ de hauteur. L’image résultat à plus de hauteur avec des nuances plus claires, et moins de hauteur (zones plus basses) avec des nuances plus sombres."; "CIShadedMaterial.inputScale" = "L’échelle de l’effet. Plus la valeur est élevée, plus l’effet est important."; "CISpotColor.inputCenterColor1" = "La valeur centrale du premier intervalle de couleurs à remplacer."; "CISpotColor.inputReplacementColor1" = "La couleur de remplacement pour le premier intervalle de couleurs."; "CISpotColor.inputCloseness1" = "Une valeur qui indique combien la première couleur doit correspondre avant d’être remplacée."; "CISpotColor.inputContrast1" = "Le contraste de la première couleur de remplacement."; "CISpotColor.inputCenterColor2" = "La valeur centrale du second intervalle de couleurs à remplacer."; "CISpotColor.inputReplacementColor2" = "La couleur de remplacement pour le deuxième intervalle de couleurs.";"CISpotColor.inputCloseness2" = "Une valeur qui indique combien la deuxième couleur doit correspondre avant d’être remplacée."; "CISpotColor.inputContrast2" = "Le contraste de la deuxième couleur de remplacement."; "CISpotColor.inputCenterColor3" = "La valeur centrale du troisième intervalle de couleurs à remplacer.";  "CISpotColor.inputReplacementColor3" = "La couleur de remplacement pour le troisième intervalle de couleurs."; "CISpotColor.inputCloseness3" = "Une valeur qui indique combien la troisième couleur doit correspondre avant d’être remplacée.";  "CISpotColor.inputContrast3" = "Le contraste de la troisième couleur de remplacement.";  "CISpotLight.inputLightPosition" = "La position x et y du projecteur."; 		"CISpotLight.inputLightPointsAt" = "La position x et y visées par le projecteur.";  "CISpotLight.inputBrightness" = "La luminosité du projecteur."; "CISpotLight.inputConcentration" = "La taille du projecteur. Plus la valeur est faible, plus le faisceau lumineux est concentré."; "CISpotLight.inputColor" = "La couleur du projecteur."; "CIAffineClamp.inputTransform" = "La transformation à appliquer à l’image."; "CIAffineTile.inputTransform" = "La transformation à appliquer à l’image."; "CIEightfoldReflectedTile.inputCenter" = "La position x et y à employer comme centre de l’effet.";  "CIEightfoldReflectedTile.inputAngle" = "L’angle du motif en mosaïque (en degrés)."; "CIEightfoldReflectedTile.inputWidth" = "La largeur d’un élément de la mosaïque."; "CIFourfoldReflectedTile.inputCenter" = "La position x et y à employer comme centre de l’effet.";  "CIFourfoldReflectedTile.inputAngle" = "L’angle du motif en mosaïque (en degrés).";  "CIFourfoldReflectedTile.inputAcuteAngle" = "L’angle principal pour la réflexion répétée de la mosaïque. De faibles valeurs résultent en de fins losanges ; des valeurs élevées produisent des éléments réfléchis plus épais."; "CIFourfoldReflectedTile.inputWidth" = "La largeur d’un élément de la mosaïque.";  "CIFourfoldRotatedTile.inputCenter" = "La position x et y à employer comme centre de l’effet.";  "CIFourfoldRotatedTile.inputAngle" = "L’angle du motif en mosaïque (en degrés).";  "CIFourfoldRotatedTile.inputWidth" = "La largeur d’un élément de la mosaïque."; "CIFourfoldTranslatedTile.inputCenter" = "La position x et y à employer comme centre de l’effet.";  "CIFourfoldTranslatedTile.inputAngle" = "L’angle du motif en mosaïque (en degrés).";  "CIFourfoldTranslatedTile.inputAcuteAngle" = "L’angle principal pour le déplacement répété de la mosaïque. De faibles valeurs résultent en de fins losanges ; des valeurs élevées produisent des éléments déplacés plus épais."; "CIFourfoldTranslatedTile.inputWidth" = "La largeur d’un élément de la mosaïque.";  "CIGlideReflectedTile.inputCenter" = "La position x et y à employer comme centre de l’effet.";  "CIGlideReflectedTile.inputAngle" = "L’angle du motif en mosaïque (en degrés).";  "CIGlideReflectedTile.inputWidth" = "La largeur d’un élément de la mosaïque.";  "CIKaleidoscope.inputCount" = "Le nombre de réflexions du motif."; "CIKaleidoscope.inputCenter" = "La position x et y à employer comme centre de l’effet.";  "CIKaleidoscope.inputAngle" = "L’angle de réflexion."; "CIOpTile.inputCenter" = "La position x et y à employer comme centre de l’effet.";  "CIOpTile.inputScale" = "L’échelle détermine le nombre d’éléments de l’effet."; "CIOpTile.inputAngle" = "L’angle d’un élément de la mosaïque."; "CIOpTile.inputWidth" = "La largeur d’un élément de la mosaïque."; "CIParallelogramTile.inputCenter" = "La position x et y à employer comme centre de l’effet."; "CIParallelogramTile.inputAngle" = "L’angle du motif en mosaïque (en degrés).";  "CIParallelogramTile.inputAcuteAngle" = "L’angle principal pour les parallélogrammes répétés de la mosaïque. De faibles valeurs résultent en de fins losanges ; des valeurs élevées produisent des parallélogrammes plus épais."; "CIParallelogramTile.inputWidth" = "La largeur d’un élément de la mosaïque.";  "CIPerspectiveTile.inputTopLeft" = "La coordonnée du coin supérieur gauche d’un élément de la mosaïque."; "CIPerspectiveTile.inputTopRight" = "La coordonnée du coin supérieur droit d’un élément de la mosaïque.";"CIPerspectiveTile.inputBottomRight" = "La coordonnée du coin inférieur droit d’un élément de la mosaïque."; "CIPerspectiveTile.inputBottomLeft" = "La coordonnée du coin inférieur gauche d’un élément de la mosaïque."; "CISixfoldReflectedTile.inputCenter" = "La position x et y à employer comme centre de l’effet.";  "CISixfoldReflectedTile.inputAngle" = "L’angle du motif en mosaïque (en degrés).";  "CISixfoldReflectedTile.inputWidth" = "La largeur d’un élément de la mosaïque."; "CISixfoldRotatedTile.inputCenter" = "La position x et y à employer comme centre de l’effet."; "CISixfoldRotatedTile.inputAngle" = "L’angle du motif en mosaïque (en degrés).";  "CISixfoldRotatedTile.inputWidth" = "La largeur d’un élément de la mosaïque.";  "CITriangleTile.inputCenter" = "La position x et y à employer comme centre de l’effet.";  "CITriangleTile.inputAngle" = "L’angle du motif en mosaïque (en degrés).";  "CITriangleTile.inputWidth" = "La largeur d’un élément de la mosaïque.";  "CITwelvefoldReflectedTile.inputCenter" = "La position x et y à employer comme centre de l’effet."; "CITwelvefoldReflectedTile.inputAngle" = "L’angle du motif en mosaïque (en degrés).";"CITwelvefoldReflectedTile.inputWidth" = "La largeur d’un élément de la mosaïque."; "CIBarsSwipeTransition.inputAngle" = "L’angle des barres (en degrés).";	"CIBarsSwipeTransition.inputWidth" = "La largeur des barres.";	"CIBarsSwipeTransition.inputBarOffset" = "Le décalage entre les barres";	"CIBarsSwipeTransition.inputTime" = "La durée paramétrique de la transition. Cette valeur contrôle la transition du début (temps 0) à la fin (temps 1).";"CICopyMachineTransition.inputColor" = "La couleur de la lumière du copieur.";"CICopyMachineTransition.inputAngle" = "L’angle de la lumière du copieur.";"CICopyMachineTransition.inputWidth" = "La largeur de la lumière du copieur.";"CICopyMachineTransition.inputOpacity" = "L’opacité de la lumière du copieur. Une valeur nulle est transparente et une valeur de 1.0 est opaque.";"CICopyMachineTransition.inputTime" = "La durée paramétrique de la transition. Cette valeur contrôle la transition du début (temps 0) à la fin (temps 1).";"CIDisintegrateWithMaskTransition.inputMaskImage" = "Une image qui définit la forme à utiliser pour la désintégration entre l’image source et l’image cible.";"CIDisintegrateWithMaskTransition.inputShadowRadius" = "Le rayon de l’ombre créée par le masque.";"CIDisintegrateWithMaskTransition.inputShadowDensity" = "La densité de l’ombre créée par le masque.";"CIDisintegrateWithMaskTransition.inputShadowOffset" = "Le décalage de l’ombre créée par le masque.";"CIDisintegrateWithMaskTransition.inputTime" = "La durée paramétrique de la transition. Cette valeur contrôle la transition du début (temps 0) à la fin (temps 1).";"CIDissolveTransition.inputTime" = "La durée paramétrique de la transition. Cette valeur contrôle la transition du début (temps 0) à la fin (temps 1).";"CIFlashTransition.inputCenter" = "La position x et y à employer comme centre de l’effet."; "CIFlashTransition.inputExtent" = "La portée du flash.";"CIFlashTransition.inputColor" = "La couleur des rayons lumineux émanant du flash.";"CIFlashTransition.inputMaxStriationRadius" = "Le rayon du cercle lumineux émanant du flash.";"CIFlashTransition.inputStriationStrength" = "L’intensité des rayons lumineux émanant du flash.";"CIFlashTransition.inputStriationContrast" = "Le contraste des rayons lumineux émanant du flash.";"CIFlashTransition.inputFadeThreshold" = "La mesure de la transition entre le flash et l’image cible. Plus la valeur est élevée, plus le flash dure longtemps, et plus la transition est rapide.";"CIFlashTransition.inputTime" = "La durée paramétrique de la transition. Cette valeur contrôle la transition du début (temps 0) à la fin (temps 1).";"CIModTransition.inputCenter" = "La position x et y à employer comme centre de l’effet."; "CIModTransition.inputAngle" = "L’angle du motif « mod hole ».";"CIModTransition.inputRadius" = "Le rayon des orifices non déformés du motif.";"CIModTransition.inputCompression" = "La quantité d’étirement appliquée au motif « mod hole ». Les orifices au centre ne seront pas autant déformés que ceux aux bords de l’image.";"CIModTransition.inputTime" = "La durée paramétrique de la transition. Cette valeur contrôle la transition du début (temps 0) à la fin (temps 1).";"CIPageCurlTransition.inputBacksideImage" = "L’image qui apparaît au dos de l’image source, alors que la page se tourne et révèle l’image cible.";"CIPageCurlTransition.inputShadingImage" = "Une image qui ressemble à une sphère ombragée incluse dans une image carrée.";"CIPageCurlTransition.inputExtent" = "La portée de l’effet.";"CIPageCurlTransition.inputAngle" = "L’angle avec lequel la page tourne.";"CIPageCurlTransition.inputRadius" = "Le rayon de la courbure.";"CIPageCurlTransition.inputTime" = "La durée paramétrique de la transition. Cette valeur contrôle la transition du début (temps 0) à la fin (temps 1).";"CIRippleTransition.inputShadingImage" = "Une image qui ressemble à une sphère ombragée incluse dans une image carrée.";"CIRippleTransition.inputCenter" = "La position x et y à employer comme centre de l’effet."; "CIRippleTransition.inputExent" = "La portée de l’effet.";"CIRippleTransition.inputWidth" = "La largeur de l’onde.";"CIRippleTransition.inputScale" = "La valeur qui détermine si l’ondulation commence par un renflement (valeur plus élevée) ou par un creux (valeur plus faible).";"CIRippleTransition.inputTime" = "La durée paramétrique de la transition. Cette valeur contrôle la transition du début (temps 0) à la fin (temps 1).";"CISwipeTransition.inputExtent" = "La portée de l’effet.";"CISwipeTransition.inputColor" = "La couleur du balayage.";"CISwipeTransition.inputAngle" = "L’angle du balayage.";"CISwipeTransition.inputWidth" = "La largeur du balayage.";"CISwipeTransition.inputOpacity" = "L’opacité du balayage.";"CISwipeTransition.inputTime" = "La durée paramétrique de la transition. Cette valeur contrôle la transition du début (temps 0) à la fin (temps 1).";"CIAreaHistogram" = "Calcule l’histogramme pour la zone de l’image spécifiée. Le résultat est une image 1D.";"CIAreaHistogram.inputExtent" = "Le rectangle représentant la région de l’image que vous souhaitez traiter.";"CIAreaHistogram.inputCount" = "Le nombre de chutiers de l’histogramme.";"CIAreaHistogram.inputImage" = "L’image dont vous souhaitez calculer l’histogramme.";"CIAreaHistogram.inputScale" = "L’échelle à employer pour les valeurs de l’histogramme.";"CIAreaMaximum" = "Calcule les valeurs maximales de composantes pour la zone de l’image spécifiée. Le résultat est un pixel.";"CIAreaMaximum.inputExtent" = "Le rectangle représentant la région de l’image que vous souhaitez traiter.";"CIAreaMaximum.inputImage" = "L’image à traiter.";"CIAreaMinimum" = "Calcule les valeurs minimales de composantes pour la zone de l’image spécifiée. Le résultat est un pixel.";"CIAreaMinimum.inputExtent" = "Le rectangle représentant la région de l’image que vous souhaitez traiter.";"CIAreaMinimum.inputImage" = "L’image à traiter.";"CIAreaMaximumAlpha" = "Cherche et renvoie le pixel ayant la valeur alpha maximum.";"CIAreaMaximumAlpha.inputExtent" = "Le rectangle représentant la région de l’image que vous souhaitez traiter.";"CIAreaMaximumAlpha.inputImage" = "L’image à traiter.";"CIAreaMinimumAlpha" = "Cherche et renvoie le pixel ayant la valeur alpha minimum.";"CIAreaMinimumAlpha.inputExtent" = "Le rectangle représentant la région de l’image que vous souhaitez traiter.";"CIAreaMinimumAlpha.inputImage" = "L’image à traiter.";"CIAreaAverage" = "Calcule la couleur moyenne pour la zone de l’image spécifiée. Le résultat est un pixel.";"CIAreaAverage.inputExtent" = "Le rectangle représentant la région de l’image que vous souhaitez traiter.";"CIAreaAverage.inputImage" = "L’image à traiter.";"CIRowAverage" = "Calcule la couleur moyenne pour chaque rang de la zone de l’image spécifiée. Le résultat est une image 1D.";"CIRowAverage.inputExtent" = "Le rectangle représentant la région de l’image que vous souhaitez traiter.";"CIRowAverage.inputImage" = "L’image à traiter.";"CIColumnAverage" = "Calcule la couleur moyenne pour chaque colonne de la zone de l’image spécifiée. Le résultat est une image 1D.";"CIColumnAverage.inputExtent" = "Le rectangle représentant la région de l’image que vous souhaitez traiter.";"CIColumnAverage.inputImage" = "L’image à traiter.";"CIMinimumComponent" = "Convertit une image en niveaux de gris en utilisant au minimum les trois composantes de couleur.";"CIMinimumComponent.inputExtent" = "Le rectangle représentant la région de l’image que vous souhaitez traiter.";"CIMinimumComponent.inputImage" = "L’image à traiter.";"CIMaximumComponent" = "Convertit une image en niveaux de gris en utilisant au maximum les trois composantes de couleur.";"CIMaximumComponent.inputExtent" = "Le rectangle représentant la région de l’image que vous souhaitez traiter.";"CIMaximumComponent.inputImage" = "L’image à traiter.";